emea-xpress-connectors/http/src/test/resources/ifx20_corrs.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fnis="http://www.fnf.com/xes" xmlns:urn="urn:ifxforum-org:XSD:1">
   <soapenv:Header/>
   <soapenv:Body>
<fnis:CorrespondencePreferenceInqRq xmlns:ifx="urn:ifxforum-org:XSD:1" xmlns:fnis="http://www.fnf.com/xes">
    <ifx:RqUID>00000000-0000-0000-0000-000000000000</ifx:RqUID>
    <ifx:MsgRqHdr>
        <ifx:CredentialsRqHdr>
            <ifx:SubjectRole>System</ifx:SubjectRole>
            <ifx:SecTokenLogin>
                <ifx:LoginName>samm</ifx:LoginName>
                <ifx:SubjectPswd>
                    <ifx:CryptType>none</ifx:CryptType>
                    <ifx:Pswd>samm</ifx:Pswd>
                </ifx:SubjectPswd>
            </ifx:SecTokenLogin>
        </ifx:CredentialsRqHdr>
        <ifx:ContextRqHdr>
            <ifx:ClientDt>0000-00-00T00:00:00.000000-00:00</ifx:ClientDt>
            <ifx:CustLangPref>en_US</ifx:CustLangPref>
            <ifx:ClientApp>
                <ifx:Org>com.fnis.xes</ifx:Org>
                <ifx:Name>FNIS</ifx:Name>
                <ifx:Version>2.0</ifx:Version>
            </ifx:ClientApp>
            <ifx:SPName>com.fnis.xes.NEXTGEN</ifx:SPName>
        </ifx:ContextRqHdr>
    </ifx:MsgRqHdr>
    <fnis:CorrespondencePreferenceSel>
        <fnis:CorrespondencePreferenceKeys>
            <fnis:PartyKeys>
                <fnis:PartyIdent>
                    <ifx:PartyIdentValue>1</ifx:PartyIdentValue>
                </fnis:PartyIdent>
            </fnis:PartyKeys>
        </fnis:CorrespondencePreferenceKeys>
    </fnis:CorrespondencePreferenceSel>
</fnis:CorrespondencePreferenceInqRq>
   </soapenv:Body>
</soapenv:Envelope>
